-- =====================================================================================================================
-- 建库 - 主库
-- =====================================================================================================================

DROP DATABASE IF EXISTS `ee_platform`;

CREATE DATABASE IF NOT EXISTS `ee_platform`
    DEFAULT CHARACTER SET `utf8mb4`
    DEFAULT COLLATE `utf8mb4_0900_ai_ci`;

-- =====================================================================================================================
-- 建库 - 定时任务库 - Quartz
-- =====================================================================================================================

DROP DATABASE IF EXISTS `ee_quartz`;

CREATE DATABASE IF NOT EXISTS `ee_quartz`
    DEFAULT CHARACTER SET `utf8mb4`
    DEFAULT COLLATE `utf8mb4_0900_ai_ci`;

-- =====================================================================================================================
-- 建库 - 示例测试库
-- =====================================================================================================================

DROP DATABASE IF EXISTS `ee_sample`;

CREATE DATABASE IF NOT EXISTS `ee_sample`
    DEFAULT CHARACTER SET `utf8mb4`
    DEFAULT COLLATE `utf8mb4_0900_ai_ci`;
